tap "ngrok/ngrok"

# Searching
brew "fd"
brew "gnu-sed"
brew "jq"
brew "ripgrep"

# Terminal
brew "tmux"
brew "zsh"

# Monitoring
brew "btop"

# Coding
brew "neovim", args: ["HEAD"]
brew "vim"

# Developer Tools
brew "asdf"
brew "awscli"
brew "gh"
brew "glow"
brew "kubernetes-cli"
brew "lazygit"
brew "minikube"
brew "git"
brew "tig"
brew "wget"

## Casks
cask "iterm2"
cask "authy"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "google-chrome"
cask "imageoptim"
cask "lens"
cask "linear-linear"
cask "ngrok"
cask "notion"
cask "postman"
cask "raycast"
cask "zoom"
